import React from 'react';
import styles from "./FrequentlyQuestions.module.scss";
import FrequentlyQuestionItem from "../frequently-question-item/FrequentlyQuestionItem";

const FrequentlyQuestions = () => {
    return (
        <div className={styles.frequentlyQuestionsWrapper}>
            <h1>Часті <span>питання</span></h1>
            <div className={styles.frequentlyQuestionsContent}>
                <FrequentlyQuestionItem
                    question="1. Які документи потрібні для оформлення спадщини?"
                    answer="Основні документи: свідоцтво про смерть спадкодавця, документи, що підтверджують родинні
                    зв'язки, та документи на майно. Також потрібне свідоцтво про право на спадщину. Для детального
                    переліку та консультації щодо вашої конкретної ситуації, звертайтеся до фахівця."/>
                <FrequentlyQuestionItem
                    question="2. Як довго триває процес розлучення в Україні?"
                    answer="За згодою сторін без дітей — від 1 місяця. При наявності спорів чи неповнолітніх дітей —
                    від 2 місяців. Для отримання точної інформації щодо вашого випадку, рекомендуємо проконсультуватися
                    з юристом."/>
                <FrequentlyQuestionItem
                    question="3. Що робити, якщо роботодавець затримує виплату заробітної плати?"
                    answer="Спочатку варто звернутися з письмовою заявою до роботодавця. Якщо це не допомогло, можна
                     подати скаргу до Держпраці або позов до суду. Для ефективного захисту ваших прав, радимо звернутися
                      за професійною юридичною допомогою."/>
                <FrequentlyQuestionItem
                    question="4. Які підстави для відстрочки від мобілізації існують в Україні?"
                    answer="Основні підстави: стан здоров'я, сімейні обставини (наприклад, наявність трьох і більше
                    дітей), навчання на денній формі. Для повного переліку та оцінки вашої ситуації, зверніться до
                    спеціаліста."/>
                <FrequentlyQuestionItem
                    question="5. Як оскаржити рішення військкомату про призов на військову службу?"
                    answer="Потрібно подати письмову скаргу до вищого військового комісаріату або до суду. Важливо
                    зібрати всі необхідні документи, що підтверджують вашу позицію. Для грамотного складання скарги та
                    представлення ваших інтересів, рекомендовано якомога швидше звернутися до юриста."/>
                <FrequentlyQuestionItem
                    question="6. Чи можуть призвати на військову службу єдиного годувальника сім'ї?"
                    answer="Зазвичай, єдиний годувальник має право на відстрочку від призову. Однак це потребує
                    документального підтвердження статусу. Для детальної консультації та допомоги в оформленні
                    необхідних документів, зверніться до фахівця."/>
                <FrequentlyQuestionItem
                    question="7. Яка відповідальність передбачена за керування автомобілем у нетверезому стані?"
                    answer="Передбачено штраф, позбавлення права керування транспортним засобом, а при повторному
                    порушенні — можливе кримінальне покарання. Конкретне покарання залежить від обставин справи.
                    Для захисту ваших прав та інтересів у такій ситуації, рекомендуємо негайно звернутися до
                    адвоката."/>
                <FrequentlyQuestionItem
                    question="8. Як захистити свої права при купівлі неякісного товару?"
                    answer="Ви маєте право на обмін товару, повернення коштів або усунення недоліків продавцем.
                    Важливо зберігати чек та звернутися до продавця з письмовою претензією. Якщо виникли труднощі з
                    поверненням товару, юрист допоможе вам захистити ваші права споживача."/>

            </div>
        </div>
    );
};

export default FrequentlyQuestions;